<?php

use yii\db\Migration;

/**
 * Handles the creation of table `{{%cur}}`.
 */
class m240818_090718_create_cur_table extends Migration
{
    /**
     * {@inheritdoc}
     */
    public function safeUp()
    {
        $this->createTable('cur', [
            'id' => $this->primaryKey(),
            'char_code' => $this->string(10)->notNull(),
            'parser' => $this->integer(10)->notNull(),
            'name' => $this->string(50)->notNull(),
        ]);

        $this->execute(<<<SQL
INSERT INTO `cur`
VALUES (1, 'AUD', 1, 'Австралийский доллар'),
       (2, 'AZN', 1, 'Азербайджанский манат'),
       (3, 'GBP', 1, 'Фунт стерлингов Соединенного королевства'),
       (4, 'AMD', 1, 'Армянских драмов'),
       (5, 'BYN', 1, 'Белорусский рубль'),
       (6, 'BGN', 1, 'Болгарский лев'),
       (7, 'BRL', 1, 'Бразильский реал'),
       (8, 'HUF', 1, 'Венгерских форинтов'),
       (9, 'VND', 1, 'Вьетнамских донгов'),
       (10, 'HKD', 1, 'Гонконгский доллар'),
       (11, 'GEL', 1, 'Грузинский лари'),
       (12, 'DKK', 1, 'Датская крона'),
       (13, 'AED', 1, 'Дирхам ОАЭ'),
       (14, 'USD', 1, 'Доллар США'),
       (15, 'EUR', 1, 'Евро'),
       (16, 'EGP', 1, 'Египетских фунтов'),
       (17, 'INR', 1, 'Индийских рупий'),
       (18, 'IDR', 1, 'Индонезийских рупий'),
       (19, 'KZT', 1, 'Казахстанских тенге'),
       (20, 'CAD', 1, 'Канадский доллар'),
       (21, 'QAR', 1, 'Катарский риал'),
       (22, 'KGS', 1, 'Киргизских сомов'),
       (23, 'CNY', 1, 'Китайский юань'),
       (24, 'MDL', 1, 'Молдавских леев'),
       (25, 'NZD', 1, 'Новозеландский доллар'),
       (26, 'NOK', 1, 'Норвежских крон'),
       (27, 'PLN', 1, 'Польский злотый'),
       (28, 'RON', 1, 'Румынский лей'),
       (29, 'XDR', 1, 'СДР (специальные права заимствования)'),
       (30, 'SGD', 1, 'Сингапурский доллар'),
       (31, 'TJS', 1, 'Таджикских сомони'),
       (32, 'THB', 1, 'Таиландских батов'),
       (33, 'TRY', 1, 'Турецких лир'),
       (34, 'TMT', 1, 'Новый туркменский манат'),
       (35, 'UZS', 1, 'Узбекских сумов'),
       (36, 'UAH', 1, 'Украинских гривен'),
       (37, 'CZK', 1, 'Чешских крон'),
       (38, 'SEK', 1, 'Шведских крон'),
       (39, 'CHF', 1, 'Швейцарский франк'),
       (40, 'RSD', 1, 'Сербских динаров'),
       (41, 'ZAR', 1, 'Южноафриканских рэндов'),
       (42, 'KRW', 1, 'Вон Республики Корея'),
       (43, 'JPY', 1, 'Японских иен'),
       (44, 'RUB', 1, 'Российский рубль');
SQL);

        $this->createTable('{{%cur_detail}}', [
            'id' => $this->primaryKey(),
            'datetime' => $this->dateTime(),
            'cur_id' => $this->integer(11)->notNull(),
            'value' => $this->string(10)->notNull(),
        ]);

        $this->addForeignKey('cur_cur_id_fk',
        'cur_detail',
        'cur_id',
            'cur',
            'id',
            'CASCADE'
        );
    }

    /**
     * {@inheritdoc}
     */
    public function safeDown()
    {
        $this->dropForeignKey('cur_cur_id_fk', 'cur_detail');
        $this->dropTable('{{%cur}}');
        $this->dropTable('{{%cur_detail}}');
    }
}
